Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK0512GPE064.PIC
      <edc:SFRDef edc:_addr="0x1F848A20" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="-----------------------nnnnnnnnn" edc:cname="U6TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U6TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U6TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F848A30" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="-----------------------rrrrrrrrr" edc:cname="U6RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U6RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U6RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F848A40" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="U6BRG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="U6BRG" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:mask="0xfffff" edc:name="BRG" edc:nzwidth="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F848A50" edc:offset="0x39b0"/>
      <edc:SFRDef edc:_addr="0x1F84C400" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01445_dac_nbit__control_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnn------n------nn" edc:cname="DAC2CON" edc:desc="CDAC Control Register" edc:impl="0xffff8103" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000------0------00" edc:name="DAC2CON" edc:nzwidth="32" edc:por="00000000000000000------0------00" edc:portals="CLR SET INV" ltx:baseofperipheral="CDAC2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Source Select" edc:mask="0x3" edc:name="REFSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="No Reference Selected (no current consumed)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = External Vref+ Pin" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = 2 * Internal Bandgap Reference Voltage" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = AVdd" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DACOE" edc:desc="CDAC Output Enable" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Output is Disabled; drive to pin is floating" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Output is Enabled; CDAC voltage is connected to the pin." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="CDAC Enable" edc:mask="0x1" edc:name="ON" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The CDAC is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="The CDAC is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DACDAT" edc:desc="Data Input Register Bits for the CDAC" edc:mask="0xffff" edc:name="DACDAT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84C410" edc:offset="0x1f0"/>
      <edc:SFRDef edc:_addr="0x1F84C600" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01445_dac_nbit__control_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnn------n------nn" edc:cname="DAC3CON" edc:desc="CDAC Control Register" edc:impl="0xffff8103" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000------0------00" edc:name="DAC3CON" edc:nzwidth="32" edc:por="00000000000000000------0------00" edc:portals="CLR SET INV" ltx:baseofperipheral="CDAC3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Source Select" edc:mask="0x3" edc:name="REFSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="No Reference Selected (no current consumed)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = External Vref+ Pin" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = 2 * Internal Bandgap Reference Voltage" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = AVdd" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DACOE" edc:desc="CDAC Output Enable" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Output is Disabled; drive to pin is floating" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Output is Enabled; CDAC voltage is connected to the pin." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="CDAC Enable" edc:mask="0x1" edc:name="ON" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The CDAC is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="The CDAC is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DACDAT" edc:desc="Data Input Register Bits for the CDAC" edc:mask="0xffff" edc:name="DACDAT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f860000" edc:endaddr="0x1f860700" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb4_std">
      <edc:SFRDef edc:_addr="0x1F860000" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------nn--n---n--nn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1913" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------11--1---1--11" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="-------------------11--1---1--11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA8" edc:desc="" edc:mask="0x1" edc:name="ANSA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA11" edc:desc="" edc:mask="0x1" edc:name="ANSA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA12" edc:desc="" edc:mask="0x1" edc:name="ANSA12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
